posts/2015-01-13-epiphany-sunday.org
#+date: <2015-01-13>
#+filetags: prayer
#+title: Epiphany Sunday

Brian Partridge's sermon this past Sunday was a perfect antidote to our annual festival of accumulation thinly disguised as a celebration of the birth of Christ. So, I guess I should stop browsing ebay.  Here is the prayer for the week:

Holy God,

Let me not be deceived;\\
these things that I possess,\\
do I use them,\\
or do they use me?

Help me to loosen my grip\\
on that which I so tightly grasp,\\
so that I can open my hands to you.

/Amen/

