docs/posts/2015-01-13-epiphany-sunday.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 31, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Epiphany Sunday</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Epiphany Sunday</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
Brian Partridge&rsquo;s sermon this past Sunday was a perfect antidote to our annual festival of accumulation thinly disguised as a celebration of the birth of Christ. So, I guess I should stop browsing ebay.  Here is the prayer for the week:
</p>

<p>
Holy God,
</p>

<p>
Let me not be deceived;<br>
these things that I possess,<br>
do I use them,<br>
or do they use me?
</p>

<p>
Help me to loosen my grip<br>
on that which I so tightly grasp,<br>
so that I can open my hands to you.
</p>

<p>
<i>Amen</i>
</p>



<div class="tagline" id="org31653be">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 31, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
